{"name": "SB0001.01.INTR.CRS001", "type": "CR", "state": "A", "billVersion": {"billName": "SB0001", "printVersion": 1, "printVersionName": "SB0001.01.INTR", "stage": "INTR", "stageVerbose": "Introduced Senate Bill (S)", "year": "2014", "title": "A BILL FOR AN ACT to amend the Indiana Code concerning taxation", "shortDescription": "State and local taxation.", "longDescription": "", "digest": "Provides that if the value of a taxpayer's business personal property in a county that would otherwise be subject to taxation is less than $25,000 for a particular assessment date: (1) the taxpayer is not required to file a personal property return for the taxpayer's business personal property in the county for that assessment date; and (2) the taxpayer's business personal property in the county is exempt from taxation for that assessment date. Requires the taxpayer to file an annual certification with the county assessor. Provides that the tax rate for certain tax increment financing areas shall be calculated as if this exemption were not in effect. Provides that if a county or municipality receives a reimbursement, repayment, or penalty from a taxpayer on account of the taxpayer's failure to comply with the statement of benefits provided by the taxpayer as part of a property tax abatement or on account of the taxpayer's failure to comply with any other requirement to receive a property tax abatement, the county or municipal fiscal officer shall distribute the amount of the reimbursement, repayment, or penalty on a pro rata basis to each taxing unit that contains the property that was subject to the abatement deduction. Phases down the corporate income tax rate from 6.5% in 2015 to 4.9% in 2019. Reduces the research and development tax credit percentage by half for qualified research expense incurred after 2014. Provides that a taxpayer is not entitled to: (1) a college contribution tax credit for contributions made in a taxable year beginning after 2014; (2) a riverboat building tax credit for qualified investments made in a taxable year beginning after 2014; (3) a biodiesel tax credit for the production or distribution of biodiesel or blended biodiesel in a taxable year beginning after 2014; (4) an ethanol production tax credit for the production of ethanol in a taxable year beginning after 2014; and (5) a new employer tax credit for wages paid in a taxable year beginning after 2014. Repeals the voluntary remediation tax credit statute. (Under current law, tax credits may not be awarded for taxable years after 2007, and the carryforward period has expired.) Repeals the energy savings tax credit. (Under current law, the tax credit may not be awarded for costs incurred after December 31, 2011, and may not be carried forward.) Establishes the commission on business personal property and business taxation to study certain issues during the 2014 legislative interim. Requires the commission on state tax and financing policy to study income tax deductions and exemptions during the 2014 and 2015 legislative interims.", "created": null, "updated": null, "enrolled": null, "introduced": null, "filed": "2014-01-13T12:26:05", "printed": null, "link": "/2014/bills/sb0001/versions/sb0001.01.intr"}, "chair": {"position_title": "Senator", "firstName": "Brandt", "lastName": "Hershman", "party": "Republican", "link": "/2014/legislators/brandt_hershman_643", "fullName": "Senator Brandt Hershman"}, "reassignment": "", "signed": null, "reviewed": null, "link": "/2014/committee-reports/SB0001.01.INTR.CRS001", "revno": 113494, "pdfDownloadLink": "/2014/committee-reports/SB0001.01.INTR.CRS001?format=pdf"}
